Autodesk.Revit.DB.TessellatedShapeBuilderOutcome
Describes the outcome of TessellatedShapeBuilder attempt
to build geometrical objects.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Sheet
An open sheet was created.

Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Solid
A solid geometry was created.

Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Nothing
Nothing was built.

Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Mixed
A geometry and a mesh were created

Autodesk.Revit.DB.TessellatedShapeBuilderOutcome.Mesh
A mesh was created